Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.sops_file.host_secrets: Reading...
data.sops_file.host_secrets: Read complete after 0s [id=-]
data.vault_generic_secret.cloudflare_creds: Reading...
data.vault_generic_secret.common_creds: Reading...
data.vault_generic_secret.proxmox_creds: Reading...
data.vault_generic_secret.common_creds: Read complete after 0s [id=secret/common/user_profile/bryan]
data.vault_generic_secret.cloudflare_creds: Read complete after 0s [id=secret/terraform/cloudflare]
data.vault_generic_secret.proxmox_creds: Read complete after 0s [id=secret/terraform/proxmox]
data.cloudflare_zone.bryanwp: Reading...
data.cloudflare_zone.bryanwp: Read complete after 0s [id=d2287afe1d6fbddb1a27e1a5b85b0288]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # cloudflare_record.kube_workers[0] will be created
+ resource "cloudflare_record" "kube_workers" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cp.bryanwp.com"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.168.2.113"
      + zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288"
    }

  # cloudflare_record.kube_workers[1] will be created
+ resource "cloudflare_record" "kube_workers" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cp.bryanwp.com"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.168.2.60"
      + zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288"
    }

  # cloudflare_record.kube_workers[2] will be created
+ resource "cloudflare_record" "kube_workers" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cp.bryanwp.com"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.168.2.82"
      + zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288"
    }

  # proxmox_virtual_environment_file.debian_container_template will be created
+ resource "proxmox_virtual_environment_file" "debian_container_template" {
      + content_type           = "iso"
      + datastore_id           = "un"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "https://cdimage.debian.org/debian-cd/current/amd64/iso-cd/debian-12.2.0-amd64-netinst.iso"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://c4f00d43b117:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`